src/main/webapp/test_data/home/AGIS_outbound_VIRG.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
				env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
				<env:Header />
				<env:Body>
								<ns2:request
												xmlns:ns2="https://ecommerce.disconline.com.au/services/schema/5.0/home_quote">
												<header>
																<partnerId>CTM0000100</partnerId>
																<sourceId>0000000002</sourceId>
																<schemaVersion>3.0</schemaVersion>
																<partnerReference>2073613</partnerReference>
																<extension>
																				<testonly>Y</testonly>
																</extension>
																<clientIpAddress>192.168.11.64</clientIpAddress>
												</header>
																<details>
																				<cover>
																								<coverType>HHZ</coverType>
																								<commencementDate>2014-02-11</commencementDate>
																								<buildingType>01</buildingType>
																								<yearBuilt>2000</yearBuilt>
																								<heritageListed>Y</heritageListed>
																								<buildingMaterialWalls>02</buildingMaterialWalls>
																								<buildingMaterialRoof>02</buildingMaterialRoof>
																								<bodyCorporate>Y</bodyCorporate>
																								<building>
																												<rebuildCost>100000</rebuildCost>
																								</building>
																								<contents>
																												<replacementCost>50000</replacementCost>
																												<contentsAboveLimit>Y</contentsAboveLimit>
																												<alarm>
																																<alarmFitted>Y</alarmFitted>
																																<internalSiren>Y</internalSiren>
																																<externalSiren>Y</externalSiren>
																																<externalStrobe>Y</externalStrobe>
																																<backToBaseMonitoring>Y</backToBaseMonitoring>
																												</alarm>
																								</contents>
<!-- 																								<personalEffects> -->
<!-- 																												<bicyles>1</bicyles> -->
<!-- 																												<musicalInstruments>2</musicalInstruments> -->
<!-- 																												<photoEquipment>2</photoEquipment> -->
<!-- 																												<clothing>2</clothing> -->
<!-- 																												<jewelleryWatches>2</jewelleryWatches> -->
<!-- 																												<sportEquipment>6</sportEquipment> -->
<!-- 																								</personalEffects> -->
																				<noPersonalEffects></noPersonalEffects>
																				</cover>
																				<address>
																								<postCode>4000</postCode>
																								<suburbName>Brisbane</suburbName>
																								<streetName>Ann Street</streetName>
																								<streetNumber>40</streetNumber>
																								<unitLevel>1</unitLevel>
																								<state>QLD</state>
																				</address>
																				<occupancy>
																								<ownProperty>Y</ownProperty>
<!-- 																								<residenceUse>LO</residenceUse> -->
																								<moveInDate>2014</moveInDate>
																				</occupancy>
																				<business>
																								<businessActivity>99</businessActivity>
																				</business>
																				<policyHolder>
																								<firstName>Tester</firstName>
																								<surname>Wololo</surname>
																								<email>preload.testing@comparethemarket.com.au</email>
																								<dob>1980-01-01</dob>
<!-- 																								<contactNumber>0412341234</contactNumber> -->
																								<contactNumber>12341234</contactNumber>
																								<allowMarketing>Y</allowMarketing>
																				</policyHolder>
																				<noOlderResident></noOlderResident>
																				<personalHistory >
																								<previousClaims>N</previousClaims>
																				</personalHistory >
<!-- 																				<marketing> -->
<!-- 																								<linkId>1234567</linkId> -->
<!-- 																				</marketing> -->
																</details>
								</ns2:request>
				</env:Body>
</env:Envelope>
